{
  "hello": "Opa, eai, tudo bom?",
  "welcome": "Seja muito bem-vindo ao meu portfólio",
  "developerFullStack": "Desenvolvedor Full Stack",
  "resumeTitle": "Saiba um pouquinho sobre mim:",
  "resume1": "Desenvolvedor de Software com {age} anos, formando em Engenharia da Computação, atuo na equipe da",
  "resume2": ". Apaixonado por tecnologia e resolução de problemas, tenho experiência sólida em desenvolvimento Web, atuando em projetos profissionais, educacionais e pessoais. Focado em entregar soluções eficientes.",
  "contacts": "Contatos",
  "connectWithMe": "Conecte-se comigo",
  "cvTitle": "Currículo",
  "cvActionLabel": "Abrir",
  "tecnologies": "Tecnologias",
  "skills": "Habilidades",
  "allRightsReserved": "Todos os direitos reservados © {year}",
  "poweredBy": "Hospedado pela",
  "back": "Voltar",
  "pageNotFound": {
    "buttonLabel": "Voltar para o início",
    "title": "Página não encontrada"
  },
  "privateProjectInfo": {
    "title": "Projeto protegido por licenciamento e/ou acordos de confidencialidade.",
    "description": "Por questões legais, como a LGPD (Lei Geral de Proteção de Dados) e políticas de privacidade corporativas, os links de visualização do projeto e repositórios não estão disponíveis. O código-fonte é proprietário e protegido por licenças específicas, garantindo a segurança e a integridade das informações envolvidas."
  },
  "project": {
    "description": "Descrição: ",
    "tecnologies": "Tecnologias: ",
    "openSource": "Open Source",
    "notOpenSource": "Código Privado",
    "openDetails": "Ver detalhes",
    "linkType": {
      "repository": "Repositório",
      "project": "Projeto"
    }
  },
  "header": {
    "home": "Início",
    "tecnologies": "Tecnologias",
    "skills": "Habilidades",
    "projects": "Projetos",
    "contacts": "Contatos",
    "language": "Idioma"
  },
  "projects": {
    "dkpedras": {
      "title": "Projeto DK Pedras",
      "description": "Projeto Freelance: Desenvolvimento de site para loja com catálogo de produtos. Responsável por prototipação, design, implementação de funcionalidades e manutenção. Otimizei a latência das imagens utilizando o Cloudinary com CDN para carregamento eficiente, maximizando recursos do plano gratuito."
    },
    "nutrien": {
      "title": "Plataforma Digital Nutrien",
      "description": "Desenvolvimento de um produto de gestão e varejo de insumos agrícolas, com arquitetura baseada em microserviços e micro frontends, além de uma API Gateway. Responsável pelo refinamento de tarefas, implementação de novas funcionalidades, correção de bugs, integração com Microsoft Teams, processamento de planilhas de preços em Excel e PDFs, além de desenvolver fluxos de negociação de pedidos, catálogo de produtos e carrinho de compras."
    },
    "sms": {
      "title": "Sistema de Monitoramento do Solo",
      "description": "Projeto focado no controle e cuidado de plantas domésticas, utilizando sensores de NPK, temperatura, pH, luminosidade e captura de imagem para avaliar a saúde das plantas. Inclui uma plataforma digital moderna para análise de dados, gráficos, relatórios de saúde, histórico de registros, exportação para PDF, modo escuro (dark mode) e um painel administrativo com parametrização de espécies, modo simulação, entre outras funcionalidades."
    },
    "timekeeping": {
      "title": "TimeKeeping",
      "description": "Sistema interno de apontamentos de horas trabalhadas."
    },
    "hospital": {
      "title": "Transferência de Dados entre Sistemas Hospitalares",
      "description": "Desenvolvimento de integração entre os sistemas médicos Tasy e PEP, correlacionando eventos e dados em um banco de dados unificado. Implementação de arquitetura hexagonal para otimizar a performance e a comunicação entre as aplicações, além de criação de testes unitários para garantir a confiabilidade do sistema."
    }
  },
  "skillsList": {
    "projectExperience": {
      "title": "Participação em mais de 5 Projetos de Sucesso",
      "description": "Contribuições significativas em diversos projetos de alta complexidade, tanto profissionais quanto acadêmicos, sempre com foco na qualidade e nos resultados."
    },
    "technologyExpert": {
      "title": "Especialista em Tecnologias de Ponta",
      "description": "Domínio de React, TypeScript, Node.js, NestJS, PostgreSQL, MongoDB, entre outras ferramentas e bibliotecas de alto desempenho, para criar soluções robustas e escaláveis."
    },
    "interpersonalSkills": {
      "title": "Habilidades Interpessoais",
      "description": "Habilidades avançadas em comunicação, com destaque em transmissão de conhecimentos, além de persistência na resolução de problemas complexos. Capacidade de organizar processos e promover um ambiente de trabalho colaborativo e produtivo."
    },
    "clientExperience": {
      "title": "Experiência com Clientes e Negócios",
      "description": "Atuação em projetos diversos, incluindo sistemas hospitalares, controle de horas, catálogos de produtos e na maior plataforma digital de vendas agrícolas do Brasil."
    },
    "agileDevelopment": {
      "title": "Desenvolvimento Ágil e Eficiência",
      "description": "Vivência com metodologias ágeis como Scrum e Kanban, otimizando o processo de desenvolvimento com foco em entregas rápidas e de qualidade, incluindo refinamento de tarefas e estimativas de prazo."
    },
    "softwareArchitecture": {
      "title": "Arquitetura e Boas Práticas de Software",
      "description": "Implementação de Clean Architecture, Clean Code, e práticas de design escaláveis, como arquitetura modular e hexagonal, garantindo a longevidade e manutenibilidade do código."
    }
  }
}